# Cоздать новый репо для этих задач
# Создать проект в виртуальном окружении venv
# создать скрипт, который выводит имя ОС
# опубликовать в репо проект (без venv)


import platform
import os
print("Name of the operating system:",os.name)
print("\nName of the OS system:",platform.system())
print("\nVersion of the operating system:",platform.release())